app/controllers/areas_controller.rb

  def index
    @app_search.default 'name', 'asc'

    @app_search.sort 'id', 'areas.id'
    @app_search.sort 'name', 'areas.name'

    @app_search.query = "areas.name like ? "

    alls = Area.all(
#            :include => [],
            :conditions => @app_search.conditions,
#            :conditions => ["areas.name like ? ", @app_search.keyword],
#            :conditions => [@app_search.condition_query] + @app_search.condition_keyword,
#            :conditions => [@app_search.condition_query + " and areas.name = ?"] + @app_search.condition_keyword << 'abc',
            :order => @app_search.orderby
           )
---
SELECT * FROM "areas" ORDER BY areas.id asc