app/controllers/auth_controller.rb

INSERT INTO "logs" ("created_at", "user_id", "error", "action", "updated_at") VALUES('2012-09-03 23:43:44', 1, NULL, 'login', '2012-09-03 23:43:44')
---
  def login
    unless session_get_user.blank?
      flash[:notice] = ""
      redirect_to(top_url)
      return
    end

    @display_type = DISPLAY_TYPE_SIMPLE

    if request.post?
      begin
        user = User.authenticate(params[:id], params[:password])
        raise if user.blank?
        session_set_user(user)
Log.create(:user_id => user.id, :action => action_name)