app/controllers/collect_dates_controller.rb

SELECT * FROM "collect_dates" ORDER BY collect_dates.id asc
---
  def index
    @app_search.default 'id', 'asc'

    @app_search.sort 'id', 'collect_dates.id'
    @app_search.sort 'area', 'areas.name'
    @app_search.sort 'category', 'categories.name'
    @app_search.sort 'collect_date', 'collect_dates.collect_date'

    @area_id = params[:area].blank? ? "1" : params[:area]

#    @app_search.query = "areas.name like ? or categories.name like ? "

    alls = CollectDate.all(
            :include => [:area, :category],
            :conditions => ["areas.id = ?", @area_id],
#            :conditions => @app_search.conditions,
#            :conditions => ["collect_dates.area_id like ? or areas.name like ? or collect_dates.category_id like ? or categories.name like ? or collect_dates.collect_date like ? ", @app_search.keyword, @app_search.keyword, @app_search.keyword, @app_search.keyword, @app_search.keyword],
#            :conditions => [@app_search.condition_query] + @app_search.condition_keyword,
            :order => @app_search.orderby
           )